chettrick/discobsd/discobsd/sys/stm32/machdep.c
        unsigned nbytes = *dinit++;
        unsigned fmt = *dinit++;
        if (fmt == 0) {                 /* Clear */
            do {
                *dst++ = 0;
            } while (--nbytes > 0);
        } else {                        /* Copy */
            char *src = (char*) dinit;
            do {
                *dst++ = *src++;
            } while (--nbytes > 0);
            dinit = (unsigned*) ((unsigned) (src + 3) & ~3);
        }
    }
#else
    /* Copy the .data image from flash to ram.
     * Linker places it at the end of .text segment. */
    extern unsigned _edata;
    unsigned *src = (unsigned*) &_etext;
    unsigned *dest = &__data_start;
    unsigned *limit = &_edata;
    while (dest < limit) {
        /*printf("copy %08x from (%08x) to (%08x)\n", *src, src, dest);*/
        *dest++ = *src++;
    }

#ifdef KERNEL_EXECUTABLE_RAM
    /* Copy code that must run out of ram (due to timing restrictions)
     * from flash to the executable section of kernel ram.
     * This was added to support swap on sdram */

    extern void _ramfunc_image_begin();
    extern void _ramfunc_begin();
    extern void _ramfunc_end();

    unsigned *src1 = (unsigned*) &_ramfunc_image_begin;
    unsigned *dest1 = (unsigned*)&_ramfunc_begin;
    unsigned *limit1 = (unsigned*)&_ramfunc_end;
    /*printf("copy from (%08x) to (%08x)\n", src1, dest1);*/
    while (dest1 < limit1) {
        *dest1++ = *src1++;
    }
#endif
#endif /* __MPLABX__ */

    /*
     * Setup peripheral bus clock divisor.
     */
    unsigned osccon = OSCCON & ~PIC32_OSCCON_PBDIV_MASK;
#if BUS_DIV == 1
    osccon |= PIC32_OSCCON_PBDIV_1;
#elif BUS_DIV == 2
    osccon |= PIC32_OSCCON_PBDIV_2;
#elif BUS_DIV == 4
    osccon |= PIC32_OSCCON_PBDIV_4;
#elif BUS_DIV == 8
    osccon |= PIC32_OSCCON_PBDIV_8;
#else
#error Incorrect BUS_DIV value!
#endif
    /* Unlock access to OSCCON register */
    SYSKEY = 0;
    SYSKEY = 0xaa996655;
    SYSKEY = 0x556699aa;

    OSCCON = osccon;
#endif // XXX

    /*
     * Early setup for console devices.
     */
#if CONS_MAJOR == UART_MAJOR
    uartinit(CONS_MINOR);
#endif

#if 0 // XXX
    /* Get total RAM size. */
    physmem = BMXDRMSZ;

    /*
     * When button 1 is pressed - boot to single user mode.
     */
    boothowto = 0;
    if (button1_pressed()) {
        boothowto |= RB_SINGLE;
    }
#endif // XXX
}

static void
cpuidentify()
{
    unsigned devid  = LL_DBGMCU_GetDeviceID();
    unsigned revid  = LL_DBGMCU_GetRevisionID();

    printf("cpu: ");
    switch (devid) {
    case 0x0411:
        printf("STM32F407xx");
        printf(" rev ");
        switch (revid) {
        case 0x2000:
            printf("A");
            break;
        default:
            printf("unknown 0x%04x", revid);
            break;
        }
        break;
    case 0x0434:
        printf("STM32F469xx");
        printf(" rev ");
        switch (revid) {
        case 0x1000:
            printf("A");
            break;
        default:
            printf("unknown 0x%04x", revid);
            break;
        }
        break;
    default:
        printf("device unknown 0x%03x", devid);
        printf(" rev unknown 0x%04x", revid);
        break;
    }
    printf(", %u MHz, bus %u MHz\n", CPU_KHZ/1000, BUS_KHZ/1000);

    printf("oscillator: ");
    switch (LL_RCC_GetSysClkSource()) {
    case LL_RCC_SYS_CLKSOURCE_STATUS_HSI:
        printf("high speed internal\n");
        break;
    case LL_RCC_SYS_CLKSOURCE_STATUS_HSE:
        printf("high speed external\n");
        break;
    case LL_RCC_SYS_CLKSOURCE_STATUS_PLL:
        printf("phase-locked loop, clock source: ");
        switch (LL_RCC_PLL_GetMainSource()) {
        case LL_RCC_PLLSOURCE_HSI:
            printf("high speed internal\n");
            break;
        case LL_RCC_PLLSOURCE_HSE:
            printf("high speed external\n");
            break;
        default:
            printf("unknown\n");
            break;
        }
        break;
    default:
        printf("unknown\n");
        break;
    }
}

/*
 * Check whether the controller has been successfully initialized.
 */
static int
is_controller_alive(driver, unit)
    struct driver *driver;
    int unit;
{
    struct conf_ctlr *ctlr;

    /* No controller - that's OK. */
    if (driver == 0)
        return 1;

    for (ctlr = conf_ctlr_init; ctlr->ctlr_driver; ctlr++) {
        if (ctlr->ctlr_driver == driver &&
            ctlr->ctlr_unit == unit &&
            ctlr->ctlr_alive)
        {
            return 1;
        }
    }
    return 0;
}

/*
 * Configure all controllers and devices as specified
 * in the kernel configuration file.
 */
void
kconfig()
{
    struct conf_ctlr *ctlr;
    struct conf_device *dev;

    cpuidentify();

    /* Probe and initialize controllers first. */
    for (ctlr = conf_ctlr_init; ctlr->ctlr_driver; ctlr++) {
        if ((*ctlr->ctlr_driver->d_init)(ctlr)) {
            ctlr->ctlr_alive = 1;
        }
    }

    /* Probe and initialize devices. */
    for (dev = conf_device_init; dev->dev_driver; dev++) {
        if (is_controller_alive(dev->dev_cdriver, dev->dev_ctlr)) {
            if ((*dev->dev_driver->d_init)(dev)) {
                dev->dev_alive = 1;
            }
        }
    }
}

/*
 * Sit and wait for something to happen...
 */
void
idle()
{
    /* Indicate that no process is running. */
    noproc = 1;

    /* Set SPL low so we can be interrupted. */
    int x = spl0();

    /* Wait for something to happen. */
// XXX    asm volatile ("wait");

    /* Restore previous SPL. */
    splx(x);
}

void
boot(dev, howto)
    register dev_t dev;
    register int howto;
{
    if ((howto & RB_NOSYNC) == 0 && waittime < 0 && bfreelist[0].b_forw) {
        register struct fs *fp;
        register struct buf *bp;
        int iter, nbusy;

        /*
         * Force the root filesystem's superblock to be updated,
         * so the date will be as current as possible after
         * rebooting.
         */
        fp = getfs(rootdev);
        if (fp)
            fp->fs_fmod = 1;
        waittime = 0;
        printf("syncing disks... ");
        (void) splnet();
        sync();
        for (iter = 0; iter < 20; iter++) {
            nbusy = 0;
            for (bp = &buf[NBUF]; --bp >= buf; )
                if (bp->b_flags & B_BUSY)
                    nbusy++;
            if (nbusy == 0)
                break;
            printf("%d ", nbusy);
            udelay(40000L * iter);
        }
        printf("done\n");
    }
    (void) splhigh();
    if (! (howto & RB_HALT)) {
        if ((howto & RB_DUMP) && dumpdev != NODEV) {
            /*
             * Take a dump of memory by calling (*dump)(),
             * which must correspond to dumpdev.
             * It should dump from dumplo blocks to the end
             * of memory or to the end of the logical device.
             */
            (*dump)(dumpdev);
        }
        /* Restart from dev, howto */
        /* Unlock access to reset register */
        SYSKEY = 0;
        SYSKEY = 0xaa996655;
        SYSKEY = 0x556699aa;

        /* Reset microcontroller */
        RSWRSTSET = 1;
        (void) RSWRST;
    }
    printf("halted\n");

    if (howto & RB_BOOTLOADER) {
        printf("entering bootloader\n");
        BLRKEY = 0x12345678;
        /* Unlock access to reset register */
        SYSKEY = 0;
        SYSKEY = 0xaa996655;
        SYSKEY = 0x556699aa;

        /* Reset microcontroller */
        RSWRSTSET = 1;
        (void) RSWRST;
    }

