chettrick/discobsd/discobsd/sys/stm32/machdep.c
#ifdef HALTREBOOT
    printf("press any key to reboot...");
    cngetc();

    /* Unlock access to reset register */
    SYSKEY = 0;
    SYSKEY = 0xaa996655;
    SYSKEY = 0x556699aa;

    /* Reset microcontroller */
    RSWRSTSET = 1;
    (void) RSWRST;
#endif

    for (;;) {
#ifdef POWER_ENABLED
        if (howto & RB_POWEROFF)
            power_off();
#endif
// XXX        asm volatile ("wait");
    }
    /*NOTREACHED*/
}

/*
 * Microsecond delay routine for MIPS processor.
 *
 * We rely on a hardware register Count, which is increased
 * every next clock cycle, i.e. at rate CPU_KHZ/2 per millisecond.
 */
void
udelay(usec)
    u_int usec;
{
    unsigned now = mips_read_c0_register(C0_COUNT, 0);
    unsigned final = now + usec * (CPU_KHZ / 1000) / 2;

    for (;;) {
        now = mips_read_c0_register(C0_COUNT, 0);

        /* This comparison is valid only when using a signed type. */
        if ((int) (now - final) >= 0)
            break;
    }
}

/*
 * Control LEDs, installed on the board.
 */
void led_control(int mask, int on)
{
#ifdef LED_SWAP_PORT
    if (mask & LED_SWAP) {       /* Auxiliary */
        if (on) LED_SWAP_ON();
        else    LED_SWAP_OFF();
    }
#endif
#ifdef LED_DISK_PORT
    if (mask & LED_DISK) {      /* Disk i/o */
        if (on) LED_DISK_ON();
        else    LED_DISK_OFF();
    }
#endif
#ifdef LED_KERNEL_PORT
    if (mask & LED_KERNEL) {    /* Kernel activity */
        if (on) LED_KERNEL_ON();
        else    LED_KERNEL_OFF();
    }
#endif
#ifdef LED_TTY_PORT
    if (mask & LED_TTY) {       /* Terminal i/o */
        if (on) LED_TTY_ON();
        else    LED_TTY_OFF();
    }
#endif
}

/*
 * Increment user profiling counters.
 */
void addupc(caddr_t pc, struct uprof *pbuf, int ticks)
{
    unsigned indx;

    if (pc < (caddr_t) pbuf->pr_off)
        return;

    indx = pc - (caddr_t) pbuf->pr_off;
    indx = (indx * pbuf->pr_scale) >> 16;
    if (indx >= pbuf->pr_size)
        return;

    pbuf->pr_base[indx] += ticks;
}

/*
 * ffs -- vax ffs instruction
 */
int
ffs(mask)
    register u_long mask;
{
    register int cnt;

    if (mask == 0)
        return (0);
    for (cnt = 1; !(mask&1); cnt++)
        mask >>= 1;
    return (cnt);
}

/*
 * Copy a null terminated string from one point to another.
 * Returns zero on success, ENOENT if maxlength exceeded.
 * If lencopied is non-zero, *lencopied gets the length of the copy
 * (including the null terminating byte).
 */
int
copystr(src, dest, maxlength, lencopied)
    register caddr_t src, dest;
    register u_int maxlength, *lencopied;
{
    caddr_t dest0 = dest;
    int error = ENOENT;

    if (maxlength != 0) {
        while ((*dest++ = *src++) != '\0') {
            if (--maxlength == 0) {
                /* Failed. */
                goto done;
            }
        }
        /* Succeeded. */
        error = 0;
    }
done:
    if (lencopied != 0)
        *lencopied = dest - dest0;
    return error;
}

/*
 * Calculate the length of a string.
 */
size_t
strlen(s)
    register const char *s;
{
    const char *s0 = s;

    while (*s++ != '\0')
        ;
    return s - s0 - 1;
}

/*
 * Return 0 if a user address is valid.
 * There are two memory regions allowed for user: flash and RAM.
 */
int
baduaddr(addr)
    register caddr_t addr;
{
    if (addr >= (caddr_t) USER_FLASH_START &&
        addr < (caddr_t) USER_FLASH_END)
        return 0;
    if (addr >= (caddr_t) USER_DATA_START &&
        addr < (caddr_t) USER_DATA_END)
        return 0;
    return 1;
}

/*
 * Return 0 if a kernel address is valid.
 * There is only one memory region allowed for kernel: RAM.
 */
int
badkaddr(addr)
    register caddr_t addr;
{
    if (addr >= (caddr_t) KERNEL_DATA_START &&
        addr < (caddr_t) KERNEL_DATA_END)
        return 0;
    if (addr >= (caddr_t) KERNEL_FLASH_START &&
        addr < (caddr_t) KERNEL_FLASH_START + FLASH_SIZE)
        return 0;
    return 1;
}

/*
 * Insert the specified element into a queue immediately after
 * the specified predecessor element.
 */
void insque(void *element, void *predecessor)
{
    struct que {
        struct que *q_next;
        struct que *q_prev;
    };
    register struct que *e = (struct que *) element;
    register struct que *prev = (struct que *) predecessor;

    e->q_prev = prev;
    e->q_next = prev->q_next;
    prev->q_next->q_prev = e;
    prev->q_next = e;
}

/*
 * Remove the specified element from the queue.
 */
void remque(void *element)
{
    struct que {
        struct que *q_next;
        struct que *q_prev;
    };
    register struct que *e = (struct que *) element;

    e->q_prev->q_next = e->q_next;
    e->q_next->q_prev = e->q_prev;
}

/*
 * Compare strings.
 */
int strncmp(const char *s1, const char *s2, size_t n)
{
    register int ret, tmp;

    if (n == 0)
        return 0;
    do {
        ret = *s1++ - (tmp = *s2++);
    } while ((ret == 0) && (tmp != 0) && --n);
    return ret;
}

/* Nonzero if pointer is not aligned on a "sz" boundary.  */
#define UNALIGNED(p, sz)    ((unsigned) (p) & ((sz) - 1))

/*
 * Copy data from the memory region pointed to by src0 to the memory
 * region pointed to by dst0.
 * If the regions overlap, the behavior is undefined.
 */
void
bcopy(const void *src0, void *dst0, size_t nbytes)
{
    unsigned char *dst = dst0;
    const unsigned char *src = src0;
    unsigned *aligned_dst;
    const unsigned *aligned_src;

//printf("bcopy (%08x, %08x, %d)\n", src0, dst0, nbytes);
    /* If the size is small, or either SRC or DST is unaligned,
     * then punt into the byte copy loop.  This should be rare.  */
    if (nbytes >= 4*sizeof(unsigned) &&
        ! UNALIGNED(src, sizeof(unsigned)) &&
        ! UNALIGNED(dst, sizeof(unsigned))) {
        aligned_dst = (unsigned*) dst;
        aligned_src = (const unsigned*) src;

        /* Copy 4X unsigned words at a time if possible.  */
        while (nbytes >= 4*sizeof(unsigned)) {
            *aligned_dst++ = *aligned_src++;
            *aligned_dst++ = *aligned_src++;
            *aligned_dst++ = *aligned_src++;
            *aligned_dst++ = *aligned_src++;
            nbytes -= 4*sizeof(unsigned);
        }

