chettrick/discobsd/discobsd/sys/stm32/machdep.c
        /* Copy one unsigned word at a time if possible.  */
        while (nbytes >= sizeof(unsigned)) {
            *aligned_dst++ = *aligned_src++;
            nbytes -= sizeof(unsigned);
        }

        /* Pick up any residual with a byte copier.  */
        dst = (unsigned char*) aligned_dst;
        src = (const unsigned char*) aligned_src;
    }

    while (nbytes--)
        *dst++ = *src++;
}

void *
memcpy(void *dst, const void *src, size_t nbytes)
{
    bcopy(src, dst, nbytes);
    return dst;
}

/*
 * Fill the array with zeroes.
 */
void
bzero(void *dst0, size_t nbytes)
{
    unsigned char *dst;
    unsigned *aligned_dst;

    dst = (unsigned char*) dst0;
    while (UNALIGNED(dst, sizeof(unsigned))) {
        *dst++ = 0;
        if (--nbytes == 0)
            return;
    }
    if (nbytes >= sizeof(unsigned)) {
        /* If we get this far, we know that nbytes is large and dst is word-aligned. */
        aligned_dst = (unsigned*) dst;

        while (nbytes >= 4*sizeof(unsigned)) {
            *aligned_dst++ = 0;
            *aligned_dst++ = 0;
            *aligned_dst++ = 0;
            *aligned_dst++ = 0;
            nbytes -= 4*sizeof(unsigned);
        }
        while (nbytes >= sizeof(unsigned)) {
            *aligned_dst++ = 0;
            nbytes -= sizeof(unsigned);
        }
        dst = (unsigned char*) aligned_dst;
    }

    /* Pick up the remainder with a bytewise loop.  */
    while (nbytes--)
        *dst++ = 0;
}

/*
 * Compare not more than nbytes of data pointed to by m1 with
 * the data pointed to by m2. Return an integer greater than, equal to or
 * less than zero according to whether the object pointed to by
 * m1 is greater than, equal to or less than the object
 * pointed to by m2.
 */
int
bcmp(const void *m1, const void *m2, size_t nbytes)
{
    const unsigned char *s1 = (const unsigned char*) m1;
    const unsigned char *s2 = (const unsigned char*) m2;
    const unsigned *aligned1, *aligned2;

    /* If the size is too small, or either pointer is unaligned,
     * then we punt to the byte compare loop.  Hopefully this will
     * not turn up in inner loops.  */
    if (nbytes >= 4*sizeof(unsigned) &&
        ! UNALIGNED(s1, sizeof(unsigned)) &&
        ! UNALIGNED(s2, sizeof(unsigned))) {
        /* Otherwise, load and compare the blocks of memory one
           word at a time.  */
        aligned1 = (const unsigned*) s1;
        aligned2 = (const unsigned*) s2;
        while (nbytes >= sizeof(unsigned)) {
            if (*aligned1 != *aligned2)
                break;
            aligned1++;
            aligned2++;
            nbytes -= sizeof(unsigned);
        }

        /* check remaining characters */
        s1 = (const unsigned char*) aligned1;
        s2 = (const unsigned char*) aligned2;
    }
    while (nbytes--) {
        if (*s1 != *s2)
            return *s1 - *s2;
        s1++;
        s2++;
    }
    return 0;
}

int
copyout(caddr_t from, caddr_t to, u_int nbytes)
{
    //printf("copyout (from=%p, to=%p, nbytes=%u)\n", from, to, nbytes);
    if (baduaddr(to) || baduaddr(to + nbytes - 1))
        return EFAULT;
    bcopy(from, to, nbytes);
    return 0;
}

int copyin (caddr_t from, caddr_t to, u_int nbytes)
{
    if (baduaddr(from) || baduaddr(from + nbytes - 1))
        return EFAULT;
    bcopy(from, to, nbytes);
    return 0;
}

/*
 * Routines for access to general purpose I/O pins.
 */
static const char pin_name[16] = "?ABCDEFG????????";

void gpio_set_input(int pin)
{
    struct gpioreg *port = (struct gpioreg*) &TRISA;

    port += (pin >> 4 & 15) - 1;
    port->trisset = (1 << (pin & 15));
}

void gpio_set_output(int pin)
{
    struct gpioreg *port = (struct gpioreg*) &TRISA;

    port += (pin >> 4 & 15) - 1;
    port->trisclr = (1 << (pin & 15));
}

void gpio_set(int pin)
{
    struct gpioreg *port = (struct gpioreg*) &TRISA;

    port += (pin >> 4 & 15) - 1;
    port->latset = (1 << (pin & 15));
}

void gpio_clr(int pin)
{
    struct gpioreg *port = (struct gpioreg*) &TRISA;

    port += (pin >> 4 & 15) - 1;
    port->latclr = (1 << (pin & 15));
}

int gpio_get(int pin)
{
    struct gpioreg *port = (struct gpioreg*) &TRISA;

    port += (pin >> 4 & 15) - 1;
    return ((port->port & (1 << (pin & 15))) ? 1 : 0);
}

char gpio_portname(int pin)
{
    return pin_name[(pin >> 4) & 15];
}

int gpio_pinno(int pin)
{
    return (ffs(pin) - 1);
}

static void
SD_demo(void)
{
    uint8_t SD_state = MSD_OK;

    SD_state = BSP_SD_Init();
    BSP_LED_Off(LED_ORANGE);

    if (SD_state != MSD_OK) {
        if (SD_state == MSD_ERROR_SD_NOT_PRESENT) {
            // No SD card inserted.
            BSP_LED_On(LED_RED);
        } else {
            // Some other error. Init failed.
            BSP_LED_On(LED_RED);
        }
    } else {
        // SD Init OK.
        BSP_LED_Toggle(LED_ORANGE);
        SD_state = BSP_SD_Erase(BLOCK_START_ADDR, NUM_OF_BLOCKS);
        /* Wait until SD cards are ready to use for new operation */
        while ((BSP_SD_GetCardState() != SD_TRANSFER_OK))
        {
        };
        BSP_LED_Toggle(LED_ORANGE);

        if (SD_state != MSD_OK) {
            // SD Erase failed.
            BSP_LED_On(LED_RED);
        } else {
            // SD Erase OK.
            BSP_LED_Toggle(LED_ORANGE);
            /* Fill the buffer to write */
            Fill_Buffer(aTxBuffer, BUFFER_WORDS_SIZE, 0x22FF);
            SD_state = BSP_SD_WriteBlocks(aTxBuffer, BLOCK_START_ADDR, NUM_OF_BLOCKS, SD_DATATIMEOUT);
            /* Wait until SD cards are ready to use for new operation */
            while ((BSP_SD_GetCardState() != SD_TRANSFER_OK))
            {
            };
            BSP_LED_Toggle(LED_ORANGE);

            if (SD_state != MSD_OK) {
                // SD Write failed.
                BSP_LED_On(LED_RED);
            } else {
                // SD Write OK.
                BSP_LED_Toggle(LED_ORANGE);
                SD_state = BSP_SD_ReadBlocks(aRxBuffer, BLOCK_START_ADDR, NUM_OF_BLOCKS, SD_DATATIMEOUT);
                BSP_LED_Toggle(LED_ORANGE);
                if (SD_state != MSD_OK) {
                    // SD Read failed.
                    BSP_LED_On(LED_RED);
                } else {
                    // SD Read OK.
                    BSP_LED_Toggle(LED_ORANGE);
                    if (Buffercmp(aTxBuffer, aRxBuffer, BUFFER_WORDS_SIZE) > 0) {
                        // SD Compare failed.
                        BSP_LED_On(LED_RED);
                    } else {
                        BSP_LED_Toggle(LED_ORANGE);
                        // SD Compare OK. SD Test passed.
                        BSP_LED_On(LED_GREEN);
                    }
                }
            }
        }
    }
    BSP_SD_DeInit();
}

static void
Fill_Buffer(uint32_t *pBuffer, uint32_t uwBufferLength, uint32_t uwOffset)
{
    uint32_t tmpIndex = 0;

    for (tmpIndex = 0; tmpIndex < uwBufferLength; tmpIndex++) {
        pBuffer[tmpIndex] = tmpIndex + uwOffset;
    }
}

static uint8_t
Buffercmp(uint32_t* pBuffer1, uint32_t* pBuffer2, uint16_t BufferLength)
{
    while (BufferLength--) {
        if (*pBuffer1 != *pBuffer2) {
            return 1;
        }
        pBuffer1++;
        pBuffer2++;
    }
    return 0;
}
